Revit 2027 API
PanelScheduleData.IsPanelSinglePhase Property
 Identifies if the panel is single phase.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPanelSinglePhase { get; set; }
Public Property IsPanelSinglePhase As Boolean
	Get
	Set
public:
property bool IsPanelSinglePhase {
	bool get ();
	void set (bool value);
}
member IsPanelSinglePhase : bool with get, set
Property Value
Boolean
Remarks
 If true, the panel is single phase. If false, the panel is 3-phase.
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace